package com.vsiverskyi.controllers;

import com.vsiverskyi.model.Nickname;
import com.vsiverskyi.repository.NicknameRepository;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.CommandLineRunner;
import org.springframework.context.annotation.Bean;
import org.springframework.stereotype.Component;

@Component
public class DatabaseLoader {

    @Autowired
    private NicknameRepository nicknameRepository;

    @Bean
    CommandLineRunner initDatabase() {
        return args -> {
            if (nicknameRepository.count() == 0) {
                String[] names = {
                        "Патрон", "Сірко", "Кривенька качечка", "Сміхотун", "Нікудишко", "Бабай", "Семилітка", "Пан Коцький",
                        "Колосок", "Лежень", "Ох", "П'яточкін", "Той що живе в річці", "Товсті щоки", "Таємний посол",
                        "Котигорошко", "Літачок ЛІП", "Івасик Телесик", "Коровай", "Чарівний горох", "Капітошка", "Кожум'яка",
                        "Лис Микита", "Солом'яний", "Круглячок", "Знахідка", "Амазонка", "Ант", "Русалка", "Баган", "Чугайстер",
                        "Вій", "Домовик", "Білобог", "Берегиня", "Перелесник", "Велес", "Волхв", "Дажбог", "Коляда", "Купайло",
                        "Лада", "Лель", "Марена", "Мокоша", "Оріяна", "Перун", "Полель", "Род", "Сварог", "Троян", "Ярило", "Чіпка",
                        "Мефістофель", "Інститутка", "малий Сашко", "Князь", "Діва Марія", "Гнат", "Забрьоха", "Еней", "Чурай",
                        "Палійчук", "Шрам", "Омелько", "Проня", "Синя качечка", "Палімсести", "Золотий гомін", "Зозуля", "Йонька",
                        "Мавка", "Мойсей", "Романтика", "Діва Маруся", "Вертеп", "Кобзар", "Третя Рота", "Щедрик", "Памфір",
                        "Мирний", "Мовчун", "Батько", "Білий Ворон", "Оса", "Сон", "Людка", "Мамай", "Троє друзів", "Неживий",
                        "Троянська Січ", "Дідух", "Дзвоняр", "Синиця", "Ветеран", "Козак Василь", "Сердюк", "Фрилансер", "Совість",
                        "Майдан", "Мазепа", "Лукас", "Довбуш", "Кіборг", "Синєвир", "Асканія Нова", "Джиралгач", "Хортиця",
                        "Перлина", "Клевань", "Замок Любарта", "озеро Лемурійське", "Херсонес", "Шипіт", "Радомисль", "Хотинська фортеця",
                        "Білі камені", "Буцький каньйон", "Софіївка", "Палац Шенборнів", "Станіслав", "Софія Київська", "печера Оптимістична",
                        "тюльпанове Поле", "Мигія", "Довбуш", "Чорногора", "Бакота", "Підгорець", "Острів Кохання", "Мольфар",
                        "Цур", "Перун", "Мокош", "Тур", "Веселиця", "Дрімка", "Шубін", "Пек", "Планетник", "Пан", "Хуха", "Повітруля",
                        "Сученко", "Вовкуня", "Нічниця", "Богиня", "Вихор", "Нявка", "Мелюзина", "Русалка", "Світилка", "Скарбник",
                        "Чарівник", "Змій", "Віла", "Джур-Джур", "Скіфський Вал", "Шацьк", "Петриківка", "Клебан-Бик", "Дениші",
                        "Кологава", "Мегаліт", "Манава", "Хутір Савки", "Чорне озеро", "Королівська скеля", "Тустань", "Березань",
                        "Вилкове", "Опішня", "Крейдяна Гора", "Путивль", "Плебан", "Співоча тераса", "Огуз", "Товтри", "Чигирин",
                        "Зубровиця", "Гетьманська столиця", "Святий Миколай", "Новий Світ", "Лядова", "Химера", "Старі Кодаки",
                        "Соледар", "Бердичів", "Термальні Води", "Гуляйполе", "Старуня", "Київська Русь", "Каскади", "Кам'яне обличчя",
                        "Палац Гредлів", "Ольвія", "Тіра", "Більськ", "Граніт", "Хотінь", "Джурин", "Кицівка", "Сиваш", "Меджибіж",
                        "Трахтемирів", "Шурдин", "Чернігів", "Лиса Гора"
                };

                for (int i = 0; i < names.length; i++) {
                    Nickname nickname = new Nickname();
                    nickname.setId(i);
                    nickname.setNickname(names[i]);
                    nicknameRepository.save(nickname);
                }
            }
        };
    }
}